from pyecharts.globals import ThemeType
from pyecharts import options as opts
from pyecharts.charts import Map,Timeline
from pyecharts.globals import ChartType, SymbolType
from pyecharts.commons.utils import JsCode

data1 = [("江苏", 50), ("广东", 50), ("山东", 50), ("河南", 50), ("湖北", 50), ("四川", 50), ("湖南", 50), ("河北",
                                                                                              0), ("安徽", 50), ("辽宁", 0), ("浙江", 50), ("江西", 50), ("陕西", 50), ("北京", 50), ("福建", 50),
         ("山西",50),("云南",50),("黑龙江",0),("广西",50),("贵州",50),("重庆",50),("上海",50),("吉林",0),
         ("天津",50),("新疆",0),("内蒙古",0),("甘肃",0),("海南",50),("宁夏",0),("青海",0),("西藏",0)]

data2 = [("江苏", 50), ("广东", 50), ("山东", 50), ("河南", 50), ("湖北", 50), ("四川", 50), ("湖南", 50), ("河北",
                                                                                              50), ("安徽", 50), ("辽宁", 0), ("浙江", 50), ("江西", 50), ("陕西", 50), ("北京", 50), ("福建", 50),
         ("山西",50),("云南",50),("黑龙江",0),("广西",50),("贵州",50),("重庆",50),("上海",50),("吉林",0),
         ("天津",50),("新疆",0),("内蒙古",0),("甘肃",0),("海南",50),("宁夏",50),("青海",0),("西藏",0)]

data3 = [("江苏", 50), ("广东", 50), ("山东", 50), ("河南", 50), ("湖北", 50), ("四川", 50), ("湖南", 50), ("河北",
                                                                                              50), ("安徽", 50), ("辽宁", 0), ("浙江", 50), ("江西", 50), ("陕西", 50), ("北京", 50), ("福建", 50),
         ("山西",50),("云南",50),("黑龙江",0),("广西",50),("贵州",50),("重庆",50),("上海",50),("吉林",0),
         ("天津",50),("新疆",0),("内蒙古",0),("甘肃",0),("海南",50),("宁夏",0),("青海",0),("西藏",0)]

data4 = [("江苏", 50), ("广东", 50), ("山东", 50), ("河南", 50), ("湖北", 50), ("四川", 50), ("湖南", 50), ("河北",
                                                                                              50), ("安徽", 50), ("辽宁", 0), ("浙江", 50), ("江西", 50), ("陕西", 50), ("北京", 50), ("福建", 50),
         ("山西",50),("云南",50),("黑龙江",0),("广西",50),("贵州",50),("重庆",50),("上海",50),("吉林",0),
         ("天津",50),("新疆",0),("内蒙古",0),("甘肃",0),("海南",50),("宁夏",0),("青海",0),("西藏",0)]

data5 = [("江苏", 50), ("广东", 50), ("山东", 50), ("河南", 0), ("湖北", 50), ("四川", 50), ("湖南", 50), ("河北",
                                                                                             50), ("安徽", 50), ("辽宁", 0), ("浙江", 50), ("江西", 50), ("陕西", 50), ("北京", 50), ("福建", 50),
         ("山西",0),("云南",50),("黑龙江",0),("广西",50),("贵州",50),("重庆",50),("上海",50),("吉林",0),
         ("天津",50),("新疆",0),("内蒙古",0),("甘肃",50),("海南",50),("宁夏",50),("青海",0),("西藏",0)]

data6 = [("江苏", 0), ("广东", 50), ("山东", 0), ("河南", 50), ("湖北", 50), ("四川", 50), ("湖南", 50), ("河北",
                                                                                            0), ("安徽", 0), ("辽宁", 0), ("浙江", 0), ("江西", 0), ("陕西", 50), ("北京", 0), ("福建", 50),
         ("山西",50),("云南",50),("黑龙江",0),("广西",50),("贵州",50),("重庆",50),("上海",0),("吉林",0),
         ("天津",0),("新疆",0),("内蒙古",0),("甘肃",50),("海南",50),("宁夏",50),("青海",0),("西藏",0)]

data7 = [("江苏", 0), ("广东", 50), ("山东", 0), ("河南", 0), ("湖北", 50), ("四川", 50), ("湖南", 50), ("河北",
                                                                                           0), ("安徽", 0), ("辽宁", 0), ("浙江", 50), ("江西", 50), ("陕西", 0), ("北京", 0), ("福建", 50),
         ("山西",0),("云南",50),("黑龙江",0),("广西",50),("贵州",50),("重庆",50),("上海",50),("吉林",0),
         ("天津",0),("新疆",0),("内蒙古",0),("甘肃",0),("海南",50),("宁夏",0),("青海",0),("西藏",0)]

data8 = [("江苏", 0), ("广东", 50), ("山东", 0), ("河南", 0), ("湖北", 50), ("四川", 50), ("湖南", 50), ("河北",
                                                                                           0), ("安徽", 0), ("辽宁", 0), ("浙江", 50), ("江西", 50), ("陕西", 0), ("北京", 0), ("福建", 50),
         ("山西",0),("云南",50),("黑龙江",0),("广西",50),("贵州",50),("重庆",50),("上海",50),("吉林",0),
         ("天津",0),("新疆",0),("内蒙古",0),("甘肃",0),("海南",50),("宁夏",0),("青海",0),("西藏",0)]

data9 = [("江苏", 50), ("广东", 50), ("山东", 0), ("河南", 0), ("湖北", 50), ("四川", 50), ("湖南", 50), ("河北",
                                                                                            0), ("安徽", 50), ("辽宁", 0), ("浙江", 50), ("江西", 50), ("陕西", 0), ("北京", 0), ("福建", 50),
         ("山西",0),("云南",0),("黑龙江",0),("广西",50),("贵州",50),("重庆",50),("上海",50),("吉林",0),
         ("天津",0),("新疆",0),("内蒙古",0),("甘肃",0),("海南",50),("宁夏",0),("青海",0),("西藏",0)]

data10 = [("江苏", 0), ("广东", 0), ("山东", 0), ("河南", 0), ("湖北", 0), ("四川", 0), ("湖南", 0), ("河北",
                                                                                        0), ("安徽", 0), ("辽宁", 0), ("浙江", 0), ("江西", 0), ("陕西", 0), ("北京", 0), ("福建", 0),
          ("山西",0),("云南",0),("黑龙江",0),("广西",0),("贵州",0),("重庆",0),("上海",0),("吉林",0),
          ("天津",0),("新疆",0),("内蒙古",0),("甘肃",0),("海南",0),("宁夏",0),("青海",0),("西藏",0)]


def time_map():
    list_sum = [data1, data2, data3, data4, data5, data6, data7, data8, data9, data10]
    time_list = ['陈桥兵变', '雍熙北伐', '庆历新政', '王安石变法', '靖康之变', '建炎南渡', '绍兴和议', '隆兴北伐', '襄樊之战', '崖山海战']
    time_number = [960,986,1041,1069,1126,1129,1141,1164,1267,1279]
    tl = Timeline()
    for i in range(1,11):
        map = (
            Map(init_opts=opts.InitOpts(theme=ThemeType.INFOGRAPHIC))
            .add(
                "",
                 list_sum[i-1],
                 "china",
                 label_opts=opts.LabelOpts(is_show=False),
                 is_map_symbol_show=False,
                 itemstyle_opts={
                     "normal": {"areaColor": "#323c48", "borderColor": "#404a59"},
                     "emphasis": {
                         "label": {"show": Timeline},
                         "areaColor": "rgba(255,255,255, 0.5)",
                     },
                 },
                 )
            .set_global_opts(
                title_opts=opts.TitleOpts(
                    title="宋代重大事件-{}-{}".format(time_list[i-1],time_number[i-1]),
                    pos_left="center",
                    pos_top="top",
                    title_textstyle_opts=opts.TextStyleOpts(
                        font_size=25, color="rgba(47, 7, 19, 0.9)"
                    ),),
                tooltip_opts=opts.TooltipOpts(
                    is_show=True,
                    formatter=JsCode(
                        """function(params) {
                        if ('value' in params.data) {
                            
                        }
                    }"""
                    ),
                ),
                visualmap_opts=opts.VisualMapOpts(
                    is_calculable=True,
                    dimension=0,
                    pos_left="10",
                    pos_top="center",
                    range_text=["High", "Low"],
                    range_color=["lightskyblue", "yellow", "orangered"],
                    textstyle_opts=opts.TextStyleOpts(color="#ddd"),
                    min_=0,
                    max_=50,
                    is_show=False
                ),
            )
        )
        tl.add(map, "{}".format(time_list[int(i-1)]))
        tl.add_schema(
            orient="vertical",
            is_auto_play=True,
            is_inverse=True,
            play_interval=3000,
            pos_left="null",
            pos_right="5",
            pos_top="20",
            pos_bottom="20",
            width="50",
            label_opts=opts.LabelOpts(is_show=True, color="#fff"),
        )
    return tl


